major_dict = {
    '人文社科类': {
        '马克思主义学院(文)': ['思想政治教育专业'], 
        '社会科学学部(文)(筹)': ['哲学'], 
        '文学院': ['汉语言文学', '历史学', '汉语国际教育'], 
        '社会学院': ['社会学', '社会工作'], 
        '新闻传播学院': ['广播电视学', '新闻学', '广告学'], 
        '法学院(文)': ['法学']
        }, 
    '经济管理类': {
        '经济学院': ['国际经济与贸易', '经济学', '金融学'], 
        '图书情报档案系(经)': ['信息资源管理', '档案学'], 
        '管理学院': [
            '信息管理与信息系统', 
            '工程管理', 
            '管理科学', 
            '工商管理', 
            '会计学', 
            '物流管理', 
            '人力资源管理', 
            '财务管理'
            ], 
        '法学院(经)': ['知识产权']
    }, 
    '理学工学类': {
        '理学院': [
            '理论与应用力学', 
            '数学与应用数学', 
            '信息与计算科学', 
            '应用物理学', 
            '电子信息科学与技术', 
            '微电子科学与工程', 
            '应用化学'
            ], 
        '材料科学与工程学院': [
            '冶金工程', 
            '金属材料工程', 
            '电子科学与技术', 
            '无机非金属材料工程', 
            '材料物理', 
            '高分子材料与工程'
            ], 
        '机电工程与自动化学院': [
            '测控技术与仪器', 
            '机械电子工程', 
            '工业工程', 
            '工业设计', 
            '电气工程及其自动化', 
            '机械设计制造及其自动化', 
            '智能制造工程', 
            '自动化'
            ], 
        '通信与信息工程学院': [
            '通信工程', 
            '电子信息工程', 
            '生物医学工程', 
            '光电信息科学与工程'
            ], 
        '计算机工程与科学学院': ['计算机科学与技术', '智能科学与技术'], 
        '环境与化学工程学院': ['环境工程', '化学工程与工艺'], 
        '生命科学学院': ['生物工程', '食品科学与工程'], 
        '土木工程系': ['土木工程'], 
        '上海美术学院': ['建筑学', '城乡规划'], 
        '上海电影学院': ['数字媒体技术', '数字媒体技术(卓越工程师计划)'], 
        '社会科学学部(理)(筹)': ['哲学(授哲学学士学位)'], 
        '图书情报档案系(理)': ['档案学(授管理学学士学位)', '信息资源管理(授管理学学士学位)'], 
        '法学院': ['知识产权(授法学学士学位)'], 
        '马克思主义学院(理)': ['思想政治教育专业(理)']
    }
}

